# why dis doesnt shows in vs code? ok its working (UPD)

my_team = {
    'Vlod': 'Soson',
    'Android': 'Batia',
    'Killreal': 'Gay',
    'Vitalek': 'Bandit',
    'Sergiy': 'Jean'
}

# print(my_team)
# my_team['Sergiy'] = 'Buhlo'
# print(my_team)
print(my_team.items())
print(my_team.keys())

# a = set('qwertyuiop')
# print(a)

# Задача: взяти абзац і порахувати: 1. Частоту, з якою зустріч слова. 2. Букви у порядку кількості зустрічі
# (підказка: берем абзац/строку - розб на слова - отр спис строк - множина = ключі для словника - далі ітеруємось)
# import random

# def qq():
#     for x in range(random.randrange(1, 9)):
#         print(x)
        
# qq()
